adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure_peripherals.h
#define SPU131_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU131_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU131_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU131_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU131_IPCT 1                                /*!< (unspecified)                                                        */
#define SPU131_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU131_GPIOTE 1                              /*!< (unspecified)                                                        */
#define SPU131_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU131_GPIO 1                                /*!< (unspecified)                                                        */
#define SPU131_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU131_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU131_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU131_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU131_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU131_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU131_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU131_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU131_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU131_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU131_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU132_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU132_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU132_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU132_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU132_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU132_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU132_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU132_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU132_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU132_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU132_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU132_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU132_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU132_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU132_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU132_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU132_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU132_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU132_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU132_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU133_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU133_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU133_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU133_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU133_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU133_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU133_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU133_GRTC 1                                /*!< (unspecified)                                                        */
#define SPU133_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU133_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU133_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU133_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU133_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU133_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU133_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU133_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU133_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU133_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU133_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU133_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU134_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU134_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU134_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU134_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU134_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU134_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU134_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU134_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU134_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU134_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU134_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU134_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU134_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU134_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU134_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU134_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU134_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU134_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU134_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU134_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU135_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU135_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU135_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU135_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU135_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU135_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU135_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU135_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU135_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU135_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU135_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU135_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU135_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU135_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU135_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU135_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU135_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU135_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU135_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU135_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU136_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU136_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU136_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU136_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU136_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU136_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU136_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU136_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU136_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU136_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU136_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU136_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU136_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU136_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU136_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU136_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU136_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU136_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU136_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU136_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

#define SPU137_FLATFEATURES 1                        /*!< (unspecified)                                                        */
#define SPU137_NESTEDFEATURES 1                      /*!< (unspecified)                                                        */
#define SPU137_GRTCSECONDARYOFFSET 0                 /*!< (unspecified)                                                        */
#define SPU137_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU137_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU137_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU137_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU137_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU137_GPIO 0                                /*!< (unspecified)                                                        */
#define SPU137_CRACEN 0                              /*!< (unspecified)                                                        */
#define SPU137_MRAMC 0                               /*!< (unspecified)                                                        */
#define SPU137_COEXC 0                               /*!< (unspecified)                                                        */
#define SPU137_ANTSWC 0                              /*!< (unspecified)                                                        */
#define SPU137_TDD 0                                 /*!< (unspecified)                                                        */
#define SPU137_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/
#define SPU137_SPU_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU137_SPU_NUM_CLOCK_POWER_PAIR_MAX 0        /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU137_SPU_NUM_CLOCK_POWER_PAIR_SIZE 1       /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define SPU137_SPU_NOTFULLPCPZERO 0                  /*!< (unspecified)                                                        */
#define SPU137_PENALTYTASKS 0                        /*!< (unspecified)                                                        */

/*Memory Privilege Controller*/
#define MPC_PRESENT 1
#define MPC_COUNT 6

#define MPC000_EXTEND_CLOCK_REQ 0                    /*!< (unspecified)                                                        */
#define MPC000_RTCHOKE 1                             /*!< (unspecified)                                                        */
#define MPC000_OVERRIDE_GRAN 4096                    /*!< The override region granularity is 4096 bytes                        */

#define MPC200_EXTEND_CLOCK_REQ 0                    /*!< (unspecified)                                                        */
#define MPC200_RTCHOKE 1                             /*!< (unspecified)                                                        */
#define MPC200_OVERRIDE_GRAN 4096                    /*!< The override region granularity is 4096 bytes                        */

#define MPC110_EXTEND_CLOCK_REQ 1                    /*!< (unspecified)                                                        */
#define MPC110_RTCHOKE 1                             /*!< (unspecified)                                                        */
#define MPC110_OVERRIDE_GRAN 4096                    /*!< The override region granularity is 4096 bytes                        */

#define MPC111_EXTEND_CLOCK_REQ 1                    /*!< (unspecified)                                                        */
#define MPC111_RTCHOKE 1                             /*!< (unspecified)                                                        */
#define MPC111_OVERRIDE_GRAN 4096                    /*!< The override region granularity is 4096 bytes                        */

#define MPC120_EXTEND_CLOCK_REQ 0                    /*!< (unspecified)                                                        */
#define MPC120_RTCHOKE 1                             /*!< (unspecified)                                                        */
#define MPC120_OVERRIDE_GRAN 32                      /*!< The override region granularity is 32 bytes                          */

#define MPC130_EXTEND_CLOCK_REQ 0                    /*!< (unspecified)                                                        */
#define MPC130_RTCHOKE 1                             /*!< (unspecified)                                                        */
#define MPC130_OVERRIDE_GRAN 32                      /*!< The override region granularity is 32 bytes                          */

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

