adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure_peripherals.h
#define TWIS131_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS131_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS131_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS131_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS131_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS131_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS131_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS131_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS131_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS131_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS131_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS131_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS131_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIS132_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS132_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS132_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS132_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS132_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS132_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS132_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS132_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS132_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS132_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS132_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS132_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS132_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIS133_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS133_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS133_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS133_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS133_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS133_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS133_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS133_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS133_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS133_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIS134_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS134_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS134_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS134_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS134_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS134_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS134_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS134_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS134_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS134_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIS135_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS135_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS135_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS135_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS135_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS135_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS135_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS135_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS135_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS135_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIS136_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS136_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS136_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS136_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS136_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS136_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS136_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS136_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS136_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS136_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

#define TWIS137_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define TWIS137_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS137_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define TWIS137_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define TWIS137_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define TWIS137_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define TWIS137_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS137_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS137_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define TWIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define TWIS137_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

/* ============================================= SPU010 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU010.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU010_FEATURES_IPCT_CH_0       = 0,    /*!< Index of access permissions for channel 0 of IPCT                    */
  NRF_SECURE_SPU010_FEATURES_IPCT_CH_1       = 1,    /*!< Index of access permissions for channel 1 of IPCT                    */
  NRF_SECURE_SPU010_FEATURES_IPCT_CH_2       = 2,    /*!< Index of access permissions for channel 2 of IPCT                    */
  NRF_SECURE_SPU010_FEATURES_IPCT_CH_3       = 3,    /*!< Index of access permissions for channel 3 of IPCT                    */
  NRF_SECURE_SPU010_FEATURES_IPCT_INTERRUPT_0 = 24,  /*!< Index of access permissions for interrupt 0 of IPCT                  */
  NRF_SECURE_SPU010_FEATURES_IPCT_INTERRUPT_1 = 25,  /*!< Index of access permissions for interrupt 1 of IPCT                  */
  NRF_SECURE_SPU010_FEATURES_CRACEN_SEED     = 224,  /*!< Index of access permissions for SEED register of CRACEN              */
} NRF_SECURE_SPU010_FEATURES_ENUM_t;

