adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure_peripherals.h
/* ============================================= SPU120 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU120.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_0  = 192,  /*!< Index of access permissions for task pair [1:0] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_1  = 193,  /*!< Index of access permissions for task pair [3:2] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_2  = 194,  /*!< Index of access permissions for task pair [5:4] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_3  = 195,  /*!< Index of access permissions for task pair [7:6] of VPR120            */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_6  = 198,  /*!< Index of access permissions for task pair [13:12] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_7  = 199,  /*!< Index of access permissions for task pair [15:14] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_8  = 200,  /*!< Index of access permissions for task pair [17:16] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_9  = 201,  /*!< Index of access permissions for task pair [19:18] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_10 = 202,  /*!< Index of access permissions for task pair [21:20] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_11 = 203,  /*!< Index of access permissions for task pair [23:22] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_12 = 204,  /*!< Index of access permissions for task pair [25:24] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_13 = 205,  /*!< Index of access permissions for task pair [27:26] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_14 = 206,  /*!< Index of access permissions for task pair [29:28] of VPR120          */
  NRF_SECURE_SPU120_FEATURES_VPR120_TASKS_15 = 207,  /*!< Index of access permissions for task pair [31:30] of VPR120          */
} NRF_SECURE_SPU120_FEATURES_ENUM_t;

/* ============================================= SPU121 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU121.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_0    = 0,    /*!< Index of access permissions for channel 0 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_1    = 1,    /*!< Index of access permissions for channel 1 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_2    = 2,    /*!< Index of access permissions for channel 2 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_3    = 3,    /*!< Index of access permissions for channel 3 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_4    = 4,    /*!< Index of access permissions for channel 4 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_5    = 5,    /*!< Index of access permissions for channel 5 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_6    = 6,    /*!< Index of access permissions for channel 6 of IPCT120                 */
  NRF_SECURE_SPU121_FEATURES_IPCT120_CH_7    = 7,    /*!< Index of access permissions for channel 7 of IPCT120                 */
} NRF_SECURE_SPU121_FEATURES_ENUM_t;

/* ============================================= SPU122 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU122.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC120                */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC120          */
  NRF_SECURE_SPU122_FEATURES_DPPIC120_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC120          */
} NRF_SECURE_SPU122_FEATURES_ENUM_t;

/* ============================================= SPU131 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU131.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_0    = 0,    /*!< Index of access permissions for channel 0 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_1    = 1,    /*!< Index of access permissions for channel 1 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_2    = 2,    /*!< Index of access permissions for channel 2 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_3    = 3,    /*!< Index of access permissions for channel 3 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_4    = 4,    /*!< Index of access permissions for channel 4 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_5    = 5,    /*!< Index of access permissions for channel 5 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_6    = 6,    /*!< Index of access permissions for channel 6 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_IPCT130_CH_7    = 7,    /*!< Index of access permissions for channel 7 of IPCT130                 */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC130                */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC130          */
  NRF_SECURE_SPU131_FEATURES_DPPIC130_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC130          */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_0  = 64,   /*!< Index of access permissions for channel 0 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_1  = 65,   /*!< Index of access permissions for channel 1 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_2  = 66,   /*!< Index of access permissions for channel 2 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_3  = 67,   /*!< Index of access permissions for channel 3 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_4  = 68,   /*!< Index of access permissions for channel 4 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_5  = 69,   /*!< Index of access permissions for channel 5 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_6  = 70,   /*!< Index of access permissions for channel 6 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_CH_7  = 71,   /*!< Index of access permissions for channel 7 of GPIOTE130               */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_INTERRUPT_0 = 72, /*!< Index of access permissions for interrupt 0 of GPIOTE130         */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_INTERRUPT_1 = 73, /*!< Index of access permissions for interrupt 1 of GPIOTE130         */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_INTERRUPT_2 = 74, /*!< Index of access permissions for interrupt 2 of GPIOTE130         */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_INTERRUPT_3 = 75, /*!< Index of access permissions for interrupt 3 of GPIOTE130         */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_INTERRUPT_4 = 76, /*!< Index of access permissions for interrupt 4 of GPIOTE130         */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_INTERRUPT_5 = 77, /*!< Index of access permissions for interrupt 5 of GPIOTE130         */
  NRF_SECURE_SPU131_FEATURES_GPIOTE130_INTERRUPT_6 = 78, /*!< Index of access permissions for interrupt 6 of GPIOTE130         */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_0        = 128,  /*!< Index of access permissions for pin 0 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_1        = 129,  /*!< Index of access permissions for pin 1 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_2        = 130,  /*!< Index of access permissions for pin 2 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_3        = 131,  /*!< Index of access permissions for pin 3 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_4        = 132,  /*!< Index of access permissions for pin 4 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_5        = 133,  /*!< Index of access permissions for pin 5 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_6        = 134,  /*!< Index of access permissions for pin 6 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_7        = 135,  /*!< Index of access permissions for pin 7 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_8        = 136,  /*!< Index of access permissions for pin 8 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_9        = 137,  /*!< Index of access permissions for pin 9 of GPIO port P0                */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_10       = 138,  /*!< Index of access permissions for pin 10 of GPIO port P0               */
  NRF_SECURE_SPU131_FEATURES_P0_PIN_11       = 139,  /*!< Index of access permissions for pin 11 of GPIO port P0               */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_0        = 160,  /*!< Index of access permissions for pin 0 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_1        = 161,  /*!< Index of access permissions for pin 1 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_2        = 162,  /*!< Index of access permissions for pin 2 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_3        = 163,  /*!< Index of access permissions for pin 3 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_4        = 164,  /*!< Index of access permissions for pin 4 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_5        = 165,  /*!< Index of access permissions for pin 5 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_6        = 166,  /*!< Index of access permissions for pin 6 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_7        = 167,  /*!< Index of access permissions for pin 7 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_8        = 168,  /*!< Index of access permissions for pin 8 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_9        = 169,  /*!< Index of access permissions for pin 9 of GPIO port P1                */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_10       = 170,  /*!< Index of access permissions for pin 10 of GPIO port P1               */
  NRF_SECURE_SPU131_FEATURES_P1_PIN_11       = 171,  /*!< Index of access permissions for pin 11 of GPIO port P1               */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_0        = 192,  /*!< Index of access permissions for pin 0 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_1        = 193,  /*!< Index of access permissions for pin 1 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_2        = 194,  /*!< Index of access permissions for pin 2 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_3        = 195,  /*!< Index of access permissions for pin 3 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_4        = 196,  /*!< Index of access permissions for pin 4 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_5        = 197,  /*!< Index of access permissions for pin 5 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_6        = 198,  /*!< Index of access permissions for pin 6 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_7        = 199,  /*!< Index of access permissions for pin 7 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_8        = 200,  /*!< Index of access permissions for pin 8 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_9        = 201,  /*!< Index of access permissions for pin 9 of GPIO port P2                */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_10       = 202,  /*!< Index of access permissions for pin 10 of GPIO port P2               */
  NRF_SECURE_SPU131_FEATURES_P2_PIN_11       = 203,  /*!< Index of access permissions for pin 11 of GPIO port P2               */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_0        = 320,  /*!< Index of access permissions for pin 0 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_1        = 321,  /*!< Index of access permissions for pin 1 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_2        = 322,  /*!< Index of access permissions for pin 2 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_3        = 323,  /*!< Index of access permissions for pin 3 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_4        = 324,  /*!< Index of access permissions for pin 4 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_5        = 325,  /*!< Index of access permissions for pin 5 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_6        = 326,  /*!< Index of access permissions for pin 6 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_7        = 327,  /*!< Index of access permissions for pin 7 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_8        = 328,  /*!< Index of access permissions for pin 8 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_9        = 329,  /*!< Index of access permissions for pin 9 of GPIO port P6                */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_10       = 330,  /*!< Index of access permissions for pin 10 of GPIO port P6               */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_11       = 331,  /*!< Index of access permissions for pin 11 of GPIO port P6               */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_12       = 332,  /*!< Index of access permissions for pin 12 of GPIO port P6               */
  NRF_SECURE_SPU131_FEATURES_P6_PIN_13       = 333,  /*!< Index of access permissions for pin 13 of GPIO port P6               */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_0        = 352,  /*!< Index of access permissions for pin 0 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_1        = 353,  /*!< Index of access permissions for pin 1 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_2        = 354,  /*!< Index of access permissions for pin 2 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_3        = 355,  /*!< Index of access permissions for pin 3 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_4        = 356,  /*!< Index of access permissions for pin 4 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_5        = 357,  /*!< Index of access permissions for pin 5 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_6        = 358,  /*!< Index of access permissions for pin 6 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P7_PIN_7        = 359,  /*!< Index of access permissions for pin 7 of GPIO port P7                */
  NRF_SECURE_SPU131_FEATURES_P9_PIN_0        = 416,  /*!< Index of access permissions for pin 0 of GPIO port P9                */
  NRF_SECURE_SPU131_FEATURES_P9_PIN_1        = 417,  /*!< Index of access permissions for pin 1 of GPIO port P9                */
  NRF_SECURE_SPU131_FEATURES_P9_PIN_2        = 418,  /*!< Index of access permissions for pin 2 of GPIO port P9                */
  NRF_SECURE_SPU131_FEATURES_P9_PIN_3        = 419,  /*!< Index of access permissions for pin 3 of GPIO port P9                */
  NRF_SECURE_SPU131_FEATURES_P9_PIN_4        = 420,  /*!< Index of access permissions for pin 4 of GPIO port P9                */
  NRF_SECURE_SPU131_FEATURES_P9_PIN_5        = 421,  /*!< Index of access permissions for pin 5 of GPIO port P9                */
} NRF_SECURE_SPU131_FEATURES_ENUM_t;

/* ============================================= SPU132 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU132.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_0   = 32,   /*!< Index of access permissions for channel 0 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_1   = 33,   /*!< Index of access permissions for channel 1 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_2   = 34,   /*!< Index of access permissions for channel 2 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_3   = 35,   /*!< Index of access permissions for channel 3 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_4   = 36,   /*!< Index of access permissions for channel 4 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_5   = 37,   /*!< Index of access permissions for channel 5 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_6   = 38,   /*!< Index of access permissions for channel 6 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CH_7   = 39,   /*!< Index of access permissions for channel 7 of DPPIC131                */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CHG_0  = 56,   /*!< Index of access permissions for channel group 0 of DPPIC131          */
  NRF_SECURE_SPU132_FEATURES_DPPIC131_CHG_1  = 57,   /*!< Index of access permissions for channel group 1 of DPPIC131          */
} NRF_SECURE_SPU132_FEATURES_ENUM_t;

